#+title: Scimax-editmarks
#+PROPERTY: header-args :tangle yes

This library provides a editmarks for editing documents, and functions to interact with the editmarks, e.g. inserting them, accepting/rejecting them, listing them, generating them from reference documents, and converting them to other formats.

There are some related libraries.

1. [[https://github.com/joostkremers/criticmarkup-emacs][criticmark-emacs]] is the closest in spirit. The markup for the editmarks I use here is inspired by the markup in criticmarks, and it only differs to avoid some clashes with org syntax. The track changes code in this library is built from ideas in this package. I had created several additions to this in scimax/cm-mods.el that are mostly incorporated here. This library leverages text properties to make some things easier, e.g. adding keymaps, export functions, etc.
2. scimax/org-editmarks.el was written by me to use links for editmarks. This had the benefit of builtin export capability, but the link syntax was ultimately limited to one line changes.
3. scimax/ov-highlights.el was written by me to use overlays for annotations. This approach is fragile and easy to break.

scimax-editmarks was written to address the limitations above, and hopefully finally have something like track changes, and editmarks for text-based markup languages (although it was written with org-mode in mind).

`scimax-editmarks' is written in a literate programming style. Load it like this in your init files.

#+BEGIN_SRC emacs-lisp :tangle no
(org-babel-load-file "scimax-editmarks.org")
#+END_SRC

#+RESULTS:
: Loaded /Users/jkitchin/vc/jkitchin-github/scimax/scimax-editmarks.el

After you load it, you can turn on `sem-mode' to fontify the markups.

You should avoid:
1. Nesting editmarks.
2. Having editmark cross org-elements, e.g. do not put editmarks across one boundary of a src-block, a table, over a headline, etc. That is sure to mess up something.

The editmarks are supposed to support multiline markup. This is hard to do right in Emacs, so things are likely to work better if you stick  to single line editmarks. I like `visual-line-mode' for that purpose.

This document is the manual.

*** List editmarks

It is helpful to have an overview of all the editmarks in a tabular list form. Here we make that possible.  First, we need a function that gets all the editmarks.

 #+BEGIN_SRC emacs-lisp
(defun sem-get-editmarks ()
  "Return a list of the editmarks in the buffer.
Each element of the list is (type (start . end) editmark).
editmark is the full text including the markers."
  (save-excursion
    (goto-char (point-min))
    (let ((editmarks '())
	  bounds
	  cem)
      (while (setq cem (sem-next-editmark))
	(setq bounds (sem-editmark-bounds))
	(push (list (get-text-property (point) 'sem-type)
		    (current-buffer)
		    bounds
		    (buffer-substring-no-properties (car bounds) (cdr bounds)))
	      editmarks))
      editmarks)))


 #+END_SRC

 #+RESULTS:
 | delete | scimax-editmarks.org | (10941 . 16068) |

Next, we define a tabulated list view. There are a lot of moving parts here. We store the source buffer so we can get back to it. This is a little clunky, and probably won't work right if you look at multiple buffers with editmarks in them.

 #+BEGIN_SRC emacs-lisp
(defvar sem-editmark-source nil
  "Holds source buffer that the editmarks came from.")


(defun sem-editmark-display ()
  "Display the current editmarks in a tabulated list."
  (interactive)
  (save-buffer)
  (let ((buf (current-buffer)))
    (setq sem-editmark-source buf)
    (switch-to-buffer-other-window
     (get-buffer-create "*sem-editmarks*"))
    (sem-editmark-list-mode)
    (sem-editmark-refresh-list)))


(defun sem-editmark-refresh-list ()
  "Refresh the list of editmarks."
  (let ((editmarks)
	(entries))
    (with-current-buffer sem-editmark-source
      (setq editmarks (sem-get-editmarks))
      (setq entries (reverse (cl-loop for em in editmarks
				      collect
				      (list
				       nil ;id
				       (vector
					(cons (symbol-name (first em))
					      (list
					       'face (plist-get (cdr (assoc (first em) sem-editmarks)) :face)
					       'buffer (second em)
					       'bounds (third em)))
					(cons (fourth em)
					      (list 'face (plist-get (cdr (assoc (first em) sem-editmarks)) :face)))))))))
    (setq tabulated-list-entries entries
	  tabulated-list-format (vector '("Type" 20 t) '("Content" 40 t)))
    (tabulated-list-init-header)
    (tabulated-list-print)))


(defun sem-editmark-list-jump ()
  "In list mode, jump to the editmark back in the originating buffer."
  (interactive)
  (let ((buf (get-text-property (line-beginning-position) 'buffer))
	(pos (car (get-text-property (line-beginning-position) 'bounds))))
    (when pos
      (switch-to-buffer-other-window buf)
      (goto-char pos)
      (org-show-entry))))


#+END_SRC

#+RESULTS:
: sem-editmark-list-jump

In the list view, we need to have a key map that makes it easy to jump back to the highlights, accept/reject/clear/delete them, etc.

#+BEGIN_SRC emacs-lisp
(defvar sem-editmark-list-mode-map
  (let ((map (make-sparse-keymap)))
    (define-key map (kbd "q") 'bury-buffer)
    (define-key map (kbd "<return>") 'sem-editmark-list-jump)
    (define-key map (kbd "[mouse-1]") 'sem-editmark-list-jump)
    (define-key map (kbd "o") 'sem-editmark-list-jump)
    (define-key map (kbd "r") (lambda ()
				"Refresh the list."
				(interactive)
				(sem-editmark-refresh-list)))

    (define-key map (kbd "a") (lambda ()
				(interactive)
				"Accept the editmark"
				(save-window-excursion
				  (sem-editmark-list-jump)
				  (sem-accept-editmark))
				(sem-editmark-refresh-list)))

    (define-key map (kbd "c") (lambda ()
				"Clear the editmark"
				(interactive)
				(save-window-excursion
				  (sem-editmark-list-jump)
				  (sem-clear-editmark))
				(sem-editmark-refresh-list)))

    (define-key map (kbd "d") (lambda ()
				"Delete the editmark"
				(interactive)
				(save-window-excursion
				  (sem-editmark-list-jump)
				  (sem-delete-editmark))
				(sem-editmark-refresh-list)))

    (define-key map (kbd "u") (lambda ()
				"Undo in the source buffer"
				(interactive)
				(with-current-buffer sem-editmark-source
				  (undo))
				(sem-editmark-refresh-list)))

    (define-key map (kbd "4") (lambda ()
				"spellcheck the editmark"
				(interactive)
				(save-window-excursion
				  (sem-editmark-list-jump)
				  (sem-editmark-spellcheck-typo))
				(sem-editmark-refresh-list)))

    (define-key map (kbd "?") (lambda ()
				"Show keymap help."
				(interactive)
				(describe-keymap 'sem-editmark-list-mode-map)))
    map)
  "Local keymap for `sem-editmark-list-mode'.")


#+END_SRC

#+RESULTS:
: sem-editmark-list-mode-map

Finally we define a minor mode for the list view.

#+BEGIN_SRC emacs-lisp
(define-derived-mode sem-editmark-list-mode
  tabulated-list-mode "sem-editmarks"
  "Mode for viewing editmarks as a tabular list.
\\{sem-editmark-list-mode-map}"
  (setq tabulated-list-sort-key nil)
  (add-hook 'tabulated-list-revert-hook
	    #'sem-editmark-refresh-list))


 #+END_SRC

 #+RESULTS:
 : sem-editmark-list-mode

